// ------------------------------------------------
// 1. Ввести с клавиатуры 2 числа `a` и `b` (где `a <<< b`. Символ "<<<" - означает "сильно меньше" ). 
//    Запустить цикл перебора от `a` до `b`. 
//    Вывести в консоль квадраты чётных чисел.
// ------------------------------------------------
// let a = +prompt('Введите число "a"')
// let b = +prompt('Введите число "b"')
// for(let i = a; i <= b; i++) {
//   if ( i % 2 == 0) {
//     console.log(Math.pow(i , 2) );
//   }; 
// };
// ------------------------------------------------
// 2. Заставить пользователя ввести с клавиатуры число (не строку и не NaN).
// ------------------------------------------------
// do {
//     a = +prompt("Введите число:");
//  } while (isNaN(a) || a == '');
// ------------------------------------------------
// 3. Проверить число на простоту. Число вводить с клавиатуры.
// ------------------------------------------------
// let n = +prompt('Введите число:');
// for (let i = 2; i < n; i++) {
//     if (n % i === 0) {
//         console.log('не простое');
//         break
//     }else {
//         console.log('Простое');
//         break
//     }
// }
// ------------------------------------------------
// 4. Посчитать сумму простых чисел от 0 до 250.
// ------------------------------------------------
// let sum = 0;
// let n = 250;
// for (let i = 2; i <= n; i++) {
//     for (let j = 2; j < i; j++) {
//         if (i % j !== 0) {
//             sum += i;
//         };
//     }
// }
// console.log(sum);
// ------------------------------------------------